app/views/fd_types/show.html.erb


<% @fd_type.fooddrinks.each do |fooddrink| %>
---
SELECT "fooddrinks".* FROM "fooddrinks" INNER JOIN "fd_types_fooddrinks" ON "fooddrinks"."id" = "fd_types_fooddrinks"."fooddrink_id" WHERE "fd_types_fooddrinks"."fd_type_id" = ?  [["fd_type_id", 1]]