app/controllers/fd_types_controller.rb

  def show
    @fooddrinks = @fd_type.fooddrinks.paginate(page: params[:page], per_page: 9).order(created_at: :asc)
    @fd_types = FdType.all
---
SELECT "fd_types".* FROM "fd_types"