app/controllers/fd_types_controller.rb

  def index
    @fd_types = FdType.all
---
SELECT "fd_types".* FROM "fd_types"

  def show
     @fooddrinks = Fooddrink.all
    @users = User.all

    @fd_type = FdType.find(params[:id])
---
SELECT "fooddrinks".* FROM "fooddrinks"
SELECT  "fd_types".* FROM "fd_types" WHERE "fd_types"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @fd_type = FdType.new(fd_type_params)

    respond_to do |format|
      if @fd_type.save
---
INSERT INTO "fd_types" ("name", "foodtype", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "coffee"], ["foodtype", "drink"], ["created_at", "2016-10-26 02:42:05.619096"], ["updated_at", "2016-10-26 02:42:05.619096"]]

  def update
    respond_to do |format|
      if @fd_type.update(fd_type_params)
---
UPDATE "fd_types" SET "name" = ?, "updated_at" = ? WHERE "fd_types"."id" = ?  [["name", "Coffee"], ["updated_at", "2016-10-26 02:42:24.377341"], ["id", 1]]

    def set_fd_type
      @fd_type = FdType.find(params[:id])
---
SELECT  "fd_types".* FROM "fd_types" WHERE "fd_types"."id" = ? LIMIT 1  [["id", 1]]