app/controllers/fooddrinks_controller.rb

SELECT "fooddrinks".* FROM "fooddrinks"
---
  def show
    @fooddrinks = Fooddrink.all

INSERT INTO "fooddrinks" ("name", "address", "foodtype", "file", "price", "price_unit", "review", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fooddrink = Fooddrink.new(fooddrink_params)
    @fooddrink.user_id = current_user.id

    respond_to do |format|
      if @fooddrink.save

SELECT  "fooddrinks".* FROM "fooddrinks" WHERE "fooddrinks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_fooddrink
      @fooddrink = Fooddrink.find(params[:id])