app/controllers/static_pages_controller.rb

SELECT "fooddrinks".* FROM "fooddrinks"
SELECT "fd_types".* FROM "fd_types"
---
  def home
    @fooddrinks = Fooddrink.all
    @users = User.all

    @fd_types = FdType.all